workloads/vllm/results/e7_coord_vs_xcoord/coord_run3.txt
warning: `VIRTUAL_ENV=/home/yunwei37/workspace/.venv` does not match the project environment path `.venv` and will be ignored; use `--active` to target the active environment instead
INFO 03-01 00:22:12 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76655d4d11b0>, seed=0, num_prompts=50, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/gpu_ext/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:05 elapsed, 568:36:33 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [01:06<00:00,  1.32s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  66.01     
Total input tokens:                      12332     
Total generated tokens:                  10349     
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         156.79    
Peak output token throughput (tok/s):    272.00    
Peak concurrent requests:                40.00     
Total Token throughput (tok/s):          343.62    
---------------Time to First Token----------------
Mean TTFT (ms):                          7510.00   
Median TTFT (ms):                        2932.97   
P99 TTFT (ms):                           24214.04  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.38     
Median TPOT (ms):                        74.88     
P99 TPOT (ms):                           83.24     
---------------Inter-token Latency----------------
Mean ITL (ms):                           75.07     
Median ITL (ms):                         71.25     
P99 ITL (ms):                            206.31    
==================================================